tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "wez/wezterm"
# Local webserver for developers
brew "devd"
# View disk space usage and delete unwanted data, fast
brew "dua-cli"
# Adblocker that creates a hosts file from multiple sources
brew "hblock"
# Language Server for the Lua language
brew "lua-language-server"
# Package manager for the Lua programming language
brew "luarocks"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# 📦🚀 Fast, disk space efficient package manager
brew "pnpm"
# Object-relational database system
brew "postgresql", restart_service: true
# Object-relational database system
brew "postgresql@13"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Substitute for classic 'make' tool with autoconf/automake functionality
brew "scons"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Modular BSD reimplementation of NASM
brew "yasm"
# Quantum Mechanical Keyboard (QMK) Firmware
brew "qmk/qmk/qmk"
# Application uninstaller
cask "appcleaner"
# 3D creation suite
cask "blender"
# Web browser focusing on privacy
cask "brave-browser"
# Developer platform
cask "dotnet-sdk"
# Game development engine
cask "godot"
# HTTP and GraphQL Client
cask "insomnia"
# Free and open-source painting and sketching program
cask "krita"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Mouse utility to add gesture functions and smooth scrolling to 3rd party mice
cask "mouse-fix"
# VPN client focusing on security
cask "protonvpn"
# Toolbox companion for QMK Firmware
cask "qmk-toolbox"
# Mux and tag mp4 files
cask "subler"
# Xcode Extension for reformatting Swift code
cask "swiftformat-for-xcode"
# Web browser focusing on security
cask "tor-browser"
# Open-source BitTorrent client
cask "transmission"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
