tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
# Generate compilation database for clang tooling
brew "bear"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Local webserver for developers
brew "devd"
# Adblocker that creates a hosts file from multiple sources
brew "hblock"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Save disk space by cleaning non-essential files from software projects
brew "kondo"
# Language Server for the Lua language
brew "lua-language-server"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Object-relational database system
brew "postgresql", restart_service: true
# Object-relational database system
brew "postgresql@13"
# Substitute for classic 'make' tool with autoconf/automake functionality
brew "scons"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Modular BSD reimplementation of NASM
brew "yasm"
# Quantum Mechanical Keyboard (QMK) Firmware
brew "qmk/qmk/qmk"
# GPU-accelerated terminal emulator
cask "alacritty"
# Tools for building Android applications
cask "android-studio"
# Application uninstaller
cask "appcleaner"
# Web browser focusing on privacy
cask "brave-browser"
# App for testing HTTP/REST endpoints
cask "cocoarestclient"
# Voice and text chat software
cask "discord"
# Developer platform
cask "dotnet-sdk"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# Free and open-source media player
cask "iina"
# Free and open-source painting and sketching program
cask "krita"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Mouse utility to add gesture functions and smooth scrolling to 3rd party mice
cask "mouse-fix"
# VPN client focusing on security
cask "protonvpn"
# Toolbox companion for QMK Firmware
cask "qmk-toolbox"
# Video game digital distribution service
cask "steam"
# Mux and tag mp4 files
cask "subler"
# Messaging app with a focus on speed and security
cask "telegram"
# Web browser focusing on security
cask "tor-browser"
# Open-source BitTorrent client
cask "transmission"
