tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
# Dungeon exploration game
brew "angband"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# View disk space usage and delete unwanted data, fast
brew "dua-cli"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Database migrations CLI tool
brew "golang-migrate"
# Post-modern modal text editor
brew "helix"
# Language Server for the Lua language
brew "lua-language-server"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Manage compile and link flags for libraries
brew "pkg-config"
# Fast, disk space efficient package manager
brew "pnpm"
# Object-relational database system
brew "postgresql@15", restart_service: true
# Substitute for classic 'make' tool with autoconf/automake functionality
brew "scons"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Quantum Mechanical Keyboard (QMK) Firmware
brew "qmk/qmk/qmk"
# Tools for building Android applications
cask "android-studio"
# Application uninstaller
cask "appcleaner"
# 3D creation suite
cask "blender"
# 3D model editor for boxy models and pixel art textures
cask "blockbench"
# Web browser focusing on privacy
cask "brave-browser"
# Developer platform
cask "dotnet-sdk"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# HTTP and GraphQL Client
cask "insomnia"
# Free and open-source painting and sketching program
cask "krita"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Toolbox companion for QMK Firmware
cask "qmk-toolbox"
# Mux and tag mp4 files
cask "subler"
# Web browser focusing on security
cask "tor-browser"
# Open-source BitTorrent client
cask "transmission"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
